 gcc -g p1final.c
 ./a.out
enter fraction in format a b
1
2
enter fraction in format a b
1
4
1/2 + 1/4 = 3/4
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x8e0: file p1final.c, line 28.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:28
28  {
(gdb) n
30    input(&num1,&den1,&num2,&den2);
(gdb) n
enter fraction in format a b
3
8
enter fraction in format a b
4
9
31    add(num1,den1,num2,den2,&num3,&den3);
(gdb) n
32    output(num1,den1,num2,den2,num3,den3);
(gdb) p num1
$1 = 3
(gdb) p den1
$2 = 8
(gdb) p num2
$3 = 4
(gdb) p den2
$4 = 9
(gdb) p num3
$5 = 59
(gdb) p den3
$6 = 72
(gdb) n
3/8 + 4/9 = 59/72
33    return 0;
(gdb) n
34  }(gdb)