gcc -g p2final.c
 ./a.out
enter fraction in format a/b
1
3
enter fraction in format a/b
1
4
enter fraction in format a/b
12
12
the smallest among 1/3,1/4 and 12/12 is 1/4 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x86d: file p2final.c, line 51.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:51
51    f1=input_fraction();
(gdb) n
enter fraction in format a/b
3
4
52    f2=input_fraction();
(gdb) n
enter fraction in format a/b
5
6
53    f3=input_fraction();
(gdb) n
enter fraction in format a/b
1
2
54    smallest=smallest_fraction(f1,f2,f3);
(gdb) n
55    output(f1,f2,f3,smallest);
(gdb) p f1
$1 = {num = 3, den = 4}
(gdb) p f2
$2 = {num = 5, den = 6}
(gdb) p f3
$3 = {num = 1, den = 2}
(gdb) n
56    return 0;
(gdb) p smallest 
$4 = {num = 1, den = 2}
(gdb) n
57  }
(gdb
