
//p1final
gcc -g p1final.c
 ./a.out
Enter the values of num1,den1,num2 and den2
1
2
1
4
The sum of two fraction is 3/4
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x892: file p1final.c, line 23.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:23
23  {
(gdb) n
25    input(&num1,&den1,&num2,&den2);
(gdb) n
Enter the values of num1,den1,num2 and den2
3
6
5
8
26    add(num1,den1,num2,den2,&num3,&den3,&gcd);
(gdb) n
27    output(num1,den1,num2,den2,num3,den3,gcd);
(gdb) p num1
$1 = 3
(gdb) p den1
$2 = 6
(gdb) p num2
$3 = 5
(gdb) p den2
$4 = 8
(gdb) p num3
$5 = 54
(gdb) p den3
$6 = 48
(gdb) p gcd
$7 = 6
(gdb) n
The sum of two fraction is 9/8
28    return 0;
(gdb) n
29  }
(gdb)
